app/views/expense_uploads/new.html.erb

SELECT "csv_configs".* FROM "csv_configs" ORDER BY "csv_configs"."name" ASC
---

  fileInput.addEventListener('change', (e) => {
    autoDetectConfig.forEach(c => {
      if (e.target.value.indexOf(c.filename_substring) > -1) {
        configSelect.value = c.csv_config_id;
        if (c.default_category_id) categorySelect.value = c.default_category_id;
      }
    });
  });