app/controllers/api/v1/categories_controller.rb

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
    def index
      render json: ::Category.all.order(:name)

SELECT "categories".* FROM "categories" WHERE (is_revenue = 0) ORDER BY "categories"."name" ASC
SELECT "revenues".* FROM "revenues" WHERE (paid_at >= '2022-10-01 04:00:00')
---
    def listExpenses
      categories = ::Category.all.order(:name)
      categories = categories.where('is_revenue = 0')

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
SELECT "categories".* FROM "categories" WHERE "categories"."is_revenue" = $1 ORDER BY "categories"."name" ASC  [["is_revenue", 1]]
SELECT "revenues".* FROM "revenues" WHERE (paid_at >= '2022-10-01 04:00:00')
---
    def listRevenues
      categories = ::Category.all.order(:name)
      categories = categories.where('is_revenue = 1')

INSERT INTO "categories" ("name", "color", "created_at", "updated_at", "monthly_goal", "is_revenue") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Test"], ["color", "#ba3427"], ["created_at", "2022-10-18 20:34:40.277788"], ["updated_at", "2022-10-18 20:34:40.277788"], ["monthly_goal", 12000], ["is_revenue", 0]]
---
    def create
      category = ::Category.new(color: params[:color], name: params[:name], monthly_goal: params[:monthly_goal], is_revenue: params[:is_revenue])
      successful = category.save

UPDATE "categories" SET "updated_at" = $1, "monthly_goal" = $2 WHERE "categories"."id" = $3  [["updated_at", "2022-10-20 17:16:30.272640"], ["monthly_goal", 100000], ["id", 10]]
---
    def update
      category = ::Category.find(params[:id])
      successful = category.update(color: params[:color], name: params[:name], monthly_goal: params[:monthly_goal])

SELECT "expenses".* FROM "expenses" WHERE "expenses"."category_id" = $1  [["category_id", 338]]
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 29]]
---
    def destroy
      category = ::Category.find(params[:id])
      render json: nil, status: 409 and return if category.expenses.length > 0

      successful = category.destroy