app/controllers/api/v1/expenses_controller.rb

    def index
      expenses = ::Expense.all
      expenses = expenses.where('paid_at >= ?', Time.at(params[:paid_after].to_i).to_datetime) if params[:paid_after].present?
      expenses = expenses.where('paid_at <= ?', Time.at(params[:paid_before].to_i).to_datetime) if params[:paid_before].present?
      expenses = expenses.where("lower(description) ILIKE ?", "%#{params[:search].strip}%") if params[:search]&.strip.present?
      expenses = expenses.where(category_id: ::Category.where(budget_id: cookies.signed[:selectedBudget]).ids)
      expenses = expenses.where(category_id: params[:category_id]) if params[:category_id].present?
      expenses = expenses.includes(:category) if params[:include_category] == true.to_s
      expenses = expenses.paginate(params[:page], params[:per_page]) if params[:page]
      expenses = expenses.order(normalized_sort(params[:sort], params[:sort_desc])).order(id: :desc) if params[:sort]
---
SELECT "expenses".* FROM "expenses" WHERE (paid_at >= '2022-09-01 04:00:00')
SELECT "expenses".* FROM "expenses" WHERE (paid_at >= '2022-07-22 17:10:53') AND (paid_at <= '2022-10-20 17:10:53') ORDER BY paid_at DESC, "expenses"."id" DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "expenses" WHERE (paid_at >= '2022-07-22 17:10:53') AND (paid_at <= '2022-10-20 17:10:53')

    def create
      expense = ::Expense.new(description: params[:description], category_id: params[:category_id], amount: params[:amount], paid_at: params[:paid_at])
      successful = expense.save
---
INSERT INTO "expenses" ("description", "amount", "category_id", "paid_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "re"], ["amount", 2300], ["category_id", 5], ["paid_at", "2022-10-18 20:34:45.986000"], ["created_at", "2022-10-18 20:34:52.631785"], ["updated_at", "2022-10-18 20:34:52.631785"]]

    def destroy
      expense = ::Expense.find(params[:id])
      successful = expense.destroy
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
DELETE FROM "expenses" WHERE "expenses"."id" = $1  [["id", 24]]