app/controllers/api/v1/reports_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
      expensesTotal = expensesTotal.where(category_id: ::Category.where(budget_id: cookies.signed[:selectedBudget]).ids).sum(:amount)

      render json: {
        category_totals: category_totals,
        category_pourcentage: category_pourcentage,
        category_averages_for_year: average_by_category(start_date.year),
        total: expensesTotal,
        monthly_goal: User.first.monthly_goal