app/controllers/api/v1/reports_controller.rb

SELECT "expenses".* FROM "expenses" WHERE (paid_at >= '2022-10-01 04:00:00')
SELECT SUM("expenses"."amount") FROM "expenses" WHERE (paid_at >= '2022-10-01' and paid_at < '2022-11-01')
---
      averages = average_by_category(start_date.year)

      render json: {
        category_totals: category_totals,
        category_pourcentage: category_pourcentage,
        category_averages_for_year: average_by_category(start_date.year),
        total: Expense.where("paid_at >= '#{start_date}' and paid_at < '#{end_date}'").sum(:amount),
        monthly_goal: User.first.monthly_goal