app/controllers/api/v1/revenues_controller.rb

SELECT "revenues".* FROM "revenues" WHERE (paid_at >= '2022-10-01 04:00:00')
---
    def index

      revenues = ::Revenue.all
      revenues = revenues.where('paid_at >= ?', Time.at(params[:paid_after].to_i).to_datetime) if params[:paid_after].present?
      revenues = revenues.where('paid_at <= ?', Time.at(params[:paid_before].to_i).to_datetime) if params[:paid_before].present?
      revenues = revenues.where("lower(description) LIKE ?", "%#{params[:search].strip}%") if params[:search]&.strip.present?
      revenues = revenues.where(category_id: ::Category.where(budget_id: cookies.signed[:selectedBudget]).ids)
      revenues = revenues.where(category_id: params[:category_id]) if params[:category_id].present?
      revenues = revenues.includes(:category) if params[:include_category] == true.to_s
      revenues = revenues.paginate(params[:page], params[:per_page]) if params[:page]
      revenues = revenues.order(normalized_sort(params[:sort], params[:sort_desc])).order(id: :desc) if params[:sort]

INSERT INTO "revenues" ("description", "amount", "category_id", "paid_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
      budget_user = ::BudgetUser.where(user_id: cookies.signed[:user_id], budget_id: cookies.signed[:selectedBudget]).take

      render json: nil, status: 403 and return if budget_user.role_value > 2

      revenue = Revenue.new(description: params[:description], category_id: params[:category_id], amount: params[:amount], paid_at: params[:paid_at])
      successful = revenue.save