app/controllers/expense_uploads_controller.rb

  def new
    @categories = ::Category.where({budget_id: cookies.signed[:selectedBudget]}).order(:name)
    @csv_configs = ::CsvConfig.where({users_id: cookies.signed[:user_id]}).order(:name)

    @auto_detect_data = @csv_configs.map do |c|
---
SELECT "csv_configs".* FROM "csv_configs" ORDER BY "csv_configs"."name" ASC