app/controllers/expenses_controller.rb

  def index
    @category_id = params[:category_id].to_json
    @has_data = Expense.count > 0
---
SELECT COUNT(*) FROM "expenses"