app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "email@example.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def create

    email = params[:email]

    user = User.includes(:budgets).where(email: email).first

    unless user
      flash[:error] = "Incorrect login"
      redirect_to :root and return
    end

    if user.authenticate(params[:password])
      cookies.signed[:logged_in] = true
      cookies.signed[:user_id] = user.id
      cookies.signed[:selectedBudget] = user.budgets.first().id